var script_type = Array();

var script = [
["ก","ฏ","ต","จ","ซ","ศ"],
["ษ","ส","ป","ฝ","ฟ"],
["ข","ค","ฆ","ฐ","ฑ","ฒ"],
["ถ","ท","ธ","ผ","พ","ภ"],
["ฎ","ด","บ","ง","ณ","น"],
["ม","ฉ","ช","ฌ","ฬ","อ","ฮ"],
["ญ","ย","ร","ล","ว","ห"],
["กะ","กิ","กึ","กุ","เกะ","แกะ","โกะ","เกอะ"],
["กา","กี","กื","กู","เก","แก","โก","เกอ"],
["เกียะ","เกืยะ","กัวะ","เกาะ","กั","เก็","แก็"],
["เกีย","เกืย","กว","เกา","ใก","ไก"],
["ฤ","ฤๅ","ฦ","ฦๅ","กำ"],
["ใคร","ใครๆ"]
];

var latin = [
["k","t","t","c","s","s"],
["s","s","p","f","f"],
["kh","kh","kh","th","th","th"],
["th","th","th","ph","ph","ph"],
["d","d","b","ng","n","n"],
["m","ch","ch","ch","l","\'","h"],
["y","y","r","l","w","h"],
["ka","ki","keu","ku","ke","kae","ko","koe"],
["kaa","kii","keeu","kuu","kee","kaae","koo","kooe"],
["kia","keua","kua","kaw","ka","ke","kae"],
["kiia","keeua","kuua","kaaw","kai","kai"],
["ru","ruu","lu","luu","kam"],
["krai","kraikrai"]
];
