var script_type = Array();

var script = [
["ก","จ","ฏ","ฎ"],
["ด","ต","บ","ป"],
["ข","ฉ","ฐ","ถ"],
["ผ","ฝ","ศ","ษ","ส","ห"],
["ค","ฆ","ง","ช","ซ","ฌ"],
["ญ","ฑ","ฒ","ณ","ท","ธ"],
["น","พ","ฟ","ภ","ม","ย"],
["ร","ล","ว","ฬ","ฮ"],
["กะ","กิ","กึ","กุ","เกะ","แกะ","โกะ","เกอะ"],
["กา","กี","กื","กู","เก","แก","โก","เกอ"],
["เกียะ","เกืยะ","กัวะ","เกาะ","กั","เก็","แก็"],
["เกีย","เกืย","กว","เกา","ใก","ไก"],
["ฤ","ฤๅ","ฦ","ฦๅ","กำ"],
["อะ", "อิ", "เอะ", "โอะ", "อุ"],
["ใคร","ใครๆ", "อ่", "อ้"]
];

var latin = [
["k","c","t","d"],
["d","t","b","p"],
["kh","ch","th","th"],
["ph","f","s","s","s","h"],
["kh","kh","ng","ch","s","ch"],
["y","th","th","n","th","th"],
["n","ph","f","ph","m","y"],
["r","l","w","l","h"],
["ka","ki","keu","ku","ke","kae","ko","koe"],
["kaa","kii","keeu","kuu","kee","kaae","koo","kooe"],
["kia","keua","kua","kaw","ka","ke","kae"],
["kiia","keeua","kuua","kaaw","kai","kai"],
["ru","ruu","lu","luu","kam"],
["a", "i", "e", "o", "u"],
["krai","kraikrai", "low tone", "high tone"],
];

function changefont(name) {
    $("#character").css("font-family", name);
}
