var script_type = Array();

var script = [

["ກ","ຕ","ປ","ສ","ຊ"],
["ຂ","ຄ","ຖ","ທ","ຜ","ພ"],
["ມ","ນ","ງ","ຍ"],
["ຣ","ລ","ຢ","ວ","ຫ","ຮ"],
["ຝ","ຟ","ດ","ບ","ຈ"],

["ກິ","ກຶ","ກຸ","ກີ","ກື","ກໍ","ກູ"],
["ກັກ","ກົກ","ເກ","ແກ","ເກີ","ໂກ","ກໍາ"],
["ກະ","ເກະ","ແກະ","ເກິະ","ໂກະ","ເກາະ"],
["ເກັກ","ແກັກ","ກັອກ","ເກິກ","ກອກ","ເກືກ","ເກົາ"],

["ໄກ","ໃກ","ກົວ","ກັຍ"],
["ເກັຽະ","ກັຽກ","ເກຶອະ","ເກຶອກ","ກົວະ","ກັວກ"],
["ເກັຽ","ກຽກ","ເກືອ","ກວກ","ກາຍ","ກາຽ"]

];


var latin = [

["k","t","p","s","s"],
["kh","kh","th","th","ph","ph"],
["m","n","ng","ny"],
["r","l","y","w","h","h"],
["f","f","d","b","ch"],

["ki","ku","kou","kii","kuu","koo","kuu"],
["ka","ko","kee","kee","keeu","koo","kam"],
["ka","ke","ke","keu","ko","ko"],
["ke","ke","ko","keu","koo","keeu","kau"],

["kai","kai","kouua","kai"],
["kia","kia","kua","kua","koua","koua"],
["kiia","kiia","kuua","kouua","kaai","kaai"]

];
