var script_type = Array();

var script = [
["ا","و","ي","ع","غ"],
["ب","ت","ث","ن","ج","ح","خ"],
["ر","ز","س","ش","ص","ض"],
["د","ذ","ك","ل","م"],
["ط","ظ","ف","ق","ه"],		
["ا","و","يـ","عـ","غـ"],		
["بـ","تـ","ثـ","نـ","جـ","حـ","خـ"],
["ر","ز","سـ","شـ","صـ","ضـ"],
["د","ذ","كـ","لـ","مـ"],	
["طـ","ظـ","فـ","قـ","هـ"],
["ـا","ـو","ـيـ","ـعـ","ـغـ"],
["ـبـ","ـتـ","ـثـ","ـنـ","ـجـ","ـحـ","ـخـ"],
["ـر","ـز","ـسـ","ـشـ","ـصـ","ـضـ"],
["ـد","ـذ","ـكـ","ـلـ","ـمـ"],
["ـطـ","ـظـ","ـفـ","ـقـ","ـهـ"],
["ـا","ـو","ـي","ـع","ـغ"],
["ـب","ـت","ـث","ـن","ـج","ـح","ـخ"],
["ـر","ـز","ـس","ـش","ـص","ـض"],
["ـد","ـذ","ـك","ـل","ـم"],
["ـط","ـظ","ـف","ـق","ـه"]
];


var latin = [
["a","u","i","\'","gh"],
["b","t","th","n","j","h.","kh"],
["r","z","s","sh","s.","d."],
["d","dh","k","l","m"],
["t.","z.","f","q","h"],
["a","u","i","\'","gh"],
["b","t","th","n","j","h.","kh"],
["r","z","s","sh","s.","d."],
["d","dh","k","l","m"],
["t.","z.","f","q","h"],
["a","u","i","\'","gh"],
["b","t","th","n","j","h.","kh"],
["r","z","s","sh","s.","d."],
["d","dh","k","l","m"],
["t.","z.","f","q","h"],
["a","u","i","\'","gh"],
["b","t","th","n","j","h.","kh"],
["r","z","s","sh","s.","d."],
["d","dh","k","l","m"],
["t.","z.","f","q","h"]
];
