var script_type = Array();

var script = [
["ക","ച","ട","ത","പ"],
["ഖ","ഛ","ഠ","ഥ","ഫ"],
["ഗ","ജ","ഡ","ദ","ബ"],
["ഘ","ഝ","ഢ","ധ","ഭ"],
["ങ","ഞ","ണ","ന","മ"],
["യ","ര","ല","വ"],
["ശ","ഷ","സ","ഹ"],
["അ","ക","ആ","കാ"],
["ഇ","കി","ഈ","കീ"],
["ഉ","കു","ഊ","കൂ"],
["എ","കെ","ഏ","കേ"],
["ഒ","കൊ","ഓ","കോ"],
["ഋ","കൃ","ൠ","കൄ"],
["ഌ","കൢ","ൡ","കൣ"],
["ക്","കം "]
];

var latin = [
["ka","ca","ta.","ta","pa"],
["kha","cha","tha.","tha","pha"],
["ga","ja","da.","da","ba"],
["gha","jha","dha.","dha","bha"],
["nga","nya","na.","na","ma"],
["ya","ra","la","va"],
["sha","sha.","sa","ha"],
["a","ka","aa","kaa"],
["i","ki","ii","kii"],
["u","ku","uu","kuu"],
["e","ke","ee","kee"],
["o","ko","oo","koo"],
["ri", "kri", "rri", "krri"],
["li", "kli", "lli", "klli"],
["k", "kam"]
];
